# Feature Scaling

In [1]:
import pandas as pd #importing pandas library 
import warnings as wr #importing warnings library to filter warnings out
wr.filterwarnings('ignore')

In [2]:
df = pd.read_csv('supershops.csv') # creating a dataframe of 'supershops.csv'

In [3]:
df.head() #displaying the first five rows of the dataframe

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [4]:
df.shape #displaying the shape of the dataframe

(50, 5)

In [5]:
df.info() #oveall information on the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Marketing Spend  50 non-null     float64
 1   Administration   50 non-null     float64
 2   Transport        49 non-null     float64
 3   Area             50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

# Feature Scaling on each column manually

# Min Max Scaler

In [6]:
from sklearn.preprocessing import MinMaxScaler #importing MinMaxScaler from sklearn.preprocessing

In [7]:
mms = MinMaxScaler() #creating an object of MinMaxScaler

In [8]:
df_Ad = mms.fit(df[['Administration']]) #training the datapoints of Administration column

In [9]:
df[['Administration']] = df_Ad.transform(df[['Administration']]) #transforming and replacing values in the same column

In [10]:
df[['Marketing Spend']] = mms.fit_transform(df[['Marketing Spend']]) #fitting and transforming 'Marketing Spend' column
df[['Transport']] = mms.fit_transform(df[['Transport']]) #fitting and transforming 'Trasport' column

In [11]:
df.head() #displaying the scaled dataframe after fitting and transforming using 'MinMaxScaler' and 'Profit' unscaled

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# Max Absolute Scaler

In [12]:
df = pd.read_csv('supershops.csv') #creating a new dataframe of 'supershops.csv'

In [13]:
from sklearn.preprocessing import MaxAbsScaler #max absolute scaler

In [14]:
mas = MaxAbsScaler() #creating an object

In [15]:
df_MS = mas.fit(df[['Marketing Spend']]) #fitting the column

In [16]:
df[['Marketing Spend']] = df_MS.transform(df[['Marketing Spend']])#transforming and replacing the values in the same column

In [17]:
df[['Administration']] = mas.fit_transform(df[['Administration']]) #fitting and transforming the values of 'Administration'
df[['Transport']] = mas.fit_transform(df[['Transport']]) #fitting and transforming the values of 'Transport'

In [18]:
df.head() #displaying the scaled dataframe after fitting and transforming using 'MaxAbsScaler' and 'Profit' unscaled

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.749527   1.000000    Dhaka  192261.83
1         0.983359        0.828805   0.940893      Ctg  191792.06
2         0.927985        0.553781   0.864664  Rangpur  191050.39
3         0.873136        0.649738   0.812235    Dhaka  182901.99
4         0.859438        0.500378   0.776136  Rangpur  166187.94

# Standard Scaler

In [19]:
df = pd.read_csv('supershops.csv') #creating a new dataframe

In [20]:
from sklearn.preprocessing import StandardScaler #importing Standard Scaler

In [21]:
ss = StandardScaler() #creating an object of 'Standard Scaler'

In [22]:
df_TP = ss.fit(df[['Transport']]) #fitting the values of 'Transport' column

In [23]:
df[['Transport']] = df_TP.transform(df[['Transport']])#transforming and replacing the values in the same column 'Transport'

In [24]:
df[['Administration']] = ss.fit_transform(df[['Administration']]) #fitting and transforming 'Administration'
df[['Marketing Spend']] = ss.fit_transform(df[['Marketing Spend']]) #fitting and transforming 'Marketing Spend'

In [25]:
df.head() #displaying the scaled dataframe after fitting and transforming using 'StandardScaler' and 'Profit' unscaled

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# Robust Scaler

In [26]:
df = pd.read_csv('supershops.csv') #creating a new dataframe of 'supershops.csv'

In [27]:
from sklearn.preprocessing import RobustScaler #importing 'RobustScaler' for 'Robust Scaling'

In [28]:
rs = RobustScaler() #creating an object of 'RobustScaler'

In [29]:
df_Ad = rs.fit(df[['Administration']]) #fitting the data of 'Administration' column

In [30]:
df[['Administration']] = df_Ad.transform(df[['Administration']]) #transforming and replacing in 'Administration' column

In [31]:
df[['Marketing Spend']] = rs.fit_transform(df[['Marketing Spend']]) #fitting and transforming 'Marketing Spend' column

In [32]:
df[['Transport']] = rs.fit_transform(df[['Transport']]) #fitting and transforming 'Transport' column

In [33]:
df.head() #displaying the scaled dataframe using 'RobustScaler' and 'Profit' unscaled

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355   1.552016    Dhaka  192261.83
1         1.452113        0.697565   1.383714      Ctg  191792.06
2         1.303634       -0.524290   1.166654  Rangpur  191050.39
3         1.156567       -0.097977   1.017368    Dhaka  182901.99
4         1.119836       -0.761543   0.914576  Rangpur  166187.94

# Feature Scaling on each column using loop

# Min Max Scaler

In [34]:
df = pd.read_csv('supershops.csv') #creating a new dataframe

In [35]:
df.head() #displaying the first five rows of the dataframe

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [36]:
x = df.drop('Profit', axis =1) #creating a datafrmae after dropping 'Profit' column

In [37]:
x.head() #displaying the first five rows of 'x' dataframe without 'Profit'

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [38]:
for column in x.columns: #using a for loop for every column in the dataframe
    if x[column].dtypes != object: #a condition to check if datatype is not an 'object'
        df[[column]] = mms.fit_transform(df[[column]]) #fitting and transforming that particular column

In [39]:
df.head() #displaying the first five rows after being scaled with 'MinMaxScaler' and 'Profit' unscaled

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# Max Absolute Scaler

In [40]:
df = pd.read_csv('supershops.csv') #creating a new dataframe

In [41]:
df.head() #displaying the first five rows of the dataframe

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [42]:
x = df.drop('Profit', axis=1) #creating a datafrmae after dropping 'Profit' column

In [43]:
x.head() #displaying the first five rows of 'x' dataframe without 'Profit'

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [44]:
for column in x.columns: #using a for loop for every column in the dataframe
    if x[column].dtypes != object: #a condition to check if datatype is not an 'object'
        df[[column]] = mas.fit_transform(df[[column]]) #fitting and transforming that particular column

In [45]:
df.head() #displaying the first five rows after being scaled with 'MaxAbsScaler' and 'Profit' unscaled

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.749527   1.000000    Dhaka  192261.83
1         0.983359        0.828805   0.940893      Ctg  191792.06
2         0.927985        0.553781   0.864664  Rangpur  191050.39
3         0.873136        0.649738   0.812235    Dhaka  182901.99
4         0.859438        0.500378   0.776136  Rangpur  166187.94

# Standard Scaler

In [46]:
df = pd.read_csv('supershops.csv') #creating a new dataframe

In [47]:
df.head() #displaying the first five rows of the dataframe

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [48]:
x = df.drop('Profit', axis=1) #creating a datafrmae after dropping 'Profit' column

In [49]:
x.head() #displaying the first five rows of 'x' dataframe without 'Profit'

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [50]:
for column in x.columns: #using a for loop for every column in the dataframe
    if x[column].dtypes != object: #a condition to check if datatype is not an 'object'
        df[[column]] = ss.fit_transform(df[[column]]) #fitting and transforming that particular column

In [51]:
df.head() #displaying the first five rows after being scaled with 'StandardScaler' and 'Profit' unscaled

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# Robust Scaler

In [52]:
df = pd.read_csv('supershops.csv') #creating a new dataframe

In [53]:
df.head() #displaying the first five rows of the dataframe

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [54]:
x = df.drop('Profit', axis=1) #creating a datafrmae after dropping 'Profit' column

In [55]:
x.head() #displaying the first five rows of 'x' dataframe without 'Profit'

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [56]:
for column in x.columns: #using a for loop for every column in the dataframe
    if x[column].dtypes != object: #a condition to check if datatype is not an 'object'
        df[[column]] = rs.fit_transform(df[[column]]) #fitting and transforming that particular column

In [57]:
df.head() #displaying the first five rows after being scaled with 'RobustScaler' and'Profit' unscaled

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355   1.552016    Dhaka  192261.83
1         1.452113        0.697565   1.383714      Ctg  191792.06
2         1.303634       -0.524290   1.166654  Rangpur  191050.39
3         1.156567       -0.097977   1.017368    Dhaka  182901.99
4         1.119836       -0.761543   0.914576  Rangpur  166187.94

# The End!!!